alert ("У королівстві, де легенди оживають, молодий оруженосець Люк мріє стати рицарем. Він служить Сір Роберту, рицарю, який вважає, що честь — це найвища добродійність.")
var startPath = prompt("Сір Роберт ставить перед Люком випробування, що визначить його долю. \n1. Вирушити в ліс \n2. Піти через село \n3. Відправитися до замку дракона");
var finalResult;
if (startPath === "1") {
    var forestChoice = prompt("Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку. \n1. Прийняти зілля \n2. Відмовитися");
    if (forestChoice === "2") {
        finalResult = alert("Люк вибирає чесний шлях, відмовляючись від легкого успіху");
    } else if (forestChoice === "1") {
        finalResult = alert("Люк отримує надприродну силу, але залишається в боргу перед чарівницею.");
    } else {
        alert("Невірний вибір! Будь ласка, оберіть варіант.");
    }
}
else if (startPath === "2") {
    var villageChoice = prompt("Люк допомагає селянам, які потерпають від голови розбійників. \n1. Допомогти силою \n2. Знайти мирне рішення");
    if (villageChoice === "1") { finalResult = alert("Люк використовує силу для захисту селян, але отримує поранення.")}
    else if (villageChoice === "2") { finalResult = alert("Люк вирішує конфлікти миром, заробляючи повагу як лідера.")}
    else { alert("Невірний вибір! Будь ласка, оберіть варіант.")}
} 
else if (startPath === "3") {
    var dragonChoice = prompt("Люк допомагає селянам, які потерпають від голови розбійників. \n1. Допомогти силою \n2. Знайти мирне рішення");
    if (dragonChoice === "1") {
        finalResult = alert("Люк використовує силу для захисту селян, але отримує поранення.");
    } else if (dragonChoice === "2") {
        finalResult = alert("Люк вирішує конфлікти миром, заробляючи повагу як лідера.");
    } else {
        alert("Невірний вибір! Будь ласка, оберіть варіант.");
    }
} else {
    alert("Невірний вибір! Будь ласка, оберіть правильний варіант.");
}
var secondPath = prompt("Після повернення з подорожей Люка викликають на турнір. \n1. Боротьба за честь. \n2. Допомога іншому учаснику \n3.Відмова від бою");
var secondfinal;
    if (secondPath === "1"){alert("Люк демонструє свої навички, здобуваючи повагу.")}
    if (secondPath === "2"){alert("Люк допомагає пораненому рицарю, показуючи своє серце.")}
    else if(secondPath === "3"){alert(" Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати.")};

var lastPath = prompt("Король, вражений діями Люка, пропонує йому останнє завдання. \n1 Захистити королівство \n2 Пошук зниклої реліквії");
var generalfinal;
    if(lastPath === "1") {alert("Люк веде війська проти ворога, демонструючи свою відвагу.")}
    else if(lastPath === "2"){alert("Люк вирушає за древньою реліквією, що може врятувати королівство.")}

    
    if (startPath === "1" && forestChoice ==="1" && secondPath ==="2" && lastPath ==="1") {
        alert("Люк стає рицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству.");
    }
    else if (startPath === "2" && villageChoice ==="2" && secondPath ==="3" && lastPath ==="2") {
        alert("Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті.");
    }
  




    

